[{
        "name": "Levi Strauss",
        "history": "His blue jeans were a big hit with miners. The original factory, which ran for almost 100 years, still stands at 250 Valencia and is now a private Quaker school.",
        "address": "250 Valencia"
    },
    {
        "name": "Roxie",
        "history": "Built in 1909, the Roxie has been known by five other names, including The Rex and The Gaiety. It's current incarnation, as an independent movie house, dates back to the mid-70's. Today it plays hosts to Indiefest, Docfest, and an eclectic program of movies.  ",
        "address": "3117 16th St"
    },
    {
        "name": "17 Reasons Why Sign",
        "history": "This legendary sign was (controversially) taken down in 2002. Pieces of it live on in the hands of collectors, though the question mark at the end remains at large.",
        "address": "2141 Mission"
    },
    {
        "name": "Jerry Garcia House",
        "history": "The Grateful Dead frontman was raised in the Mission by his Spanish immigrant father and his tavern-running mother, who could trace her ancestors back to the Gold Rush.",
        "address": "87 Harrington St"
    },
    {
        "name": "Project Artaud",
        "history": "In 1971, a group of artists moved into an abandoned American Can Company tooling factory, and, over the next several decades, proceeded to create a live-work space for artists, as well other spin-off projects like the Traveling Jewish Theater and Southern Exposure.  ",
        "address": "499 Alabama St"
    },
    {
        "name": "Carlos Santana",
        "history": "Mission High's most famous alum (class of '65) -- or at least the one everyone keeps on talking about. He may have played at Woodstock, but he's never forgotten the Mission.",
        "address": "205 Mullen Ave"
    },
    {
        "name": "Bi-Rite",
        "history": "Owner Sam Mogan-nam and his brother took over this family-run neighborhood grocery and turned it into a hub for locally-grown (and made) food (and ice cream). They also started a nonprofit (called 18 Reasons, in homage to the sign).",
        "address": "3692 18th St"
    },
    {
        "name": "Fantasy Records",
        "history": "Greats like Dave Brubeck, Cal Tjader, Taj Mahal, and even Lenny Bruce once recorded their records here. Today, the building serves as the office of the SF Mime Troupe.",
        "address": "855 Treat St"
    },
    {
        "name": "Mission Cultural Center",
        "history": "Founded in the 1970's by a group of SFSU students frustrated at the lack of Latino representation in arts and culture, and housed in an old furniture store, the Center has gone on to host the work of artists from all over the world.",
        "address": "2868 Mission St"
    },
    {
        "name": "The Armory",
        "history": "Built for the National Guard in the 1900's, and used as a base for quelling the worker strikes that marked San Francisco in the following decades. Now owned by the porn studio Kink.com, which is considering turning part of the building into office space.",
        "address": "1800 Mission"
    },
    {
        "name": "Mission Street",
        "history": "Once known as the 'Miracle Mile', Mission Street was one of the city's major shopping and entertain-ment districts. By the late 1970's, the street had become a mix of pawn shops, dollar stores and taquerias, and by the 1990's, high-end restaurants like Foreign Cinema began to appear, the vanguard of a identity as a nightlife desti tion.",
        "address": "1700 Mission"
    },
    {
        "name": "Rainbow Grocery",
        "history": "This worker-owned collective, which dates back to the 1970's, has a colorful history, as well as an amazing cheese counter.",
        "address": "1745 Folsom St"
    },
    {
        "name": "Victoria Theater",
        "history": "Both live performances and film festivals now play at what was once known as Brown's Opera House, built in 1908 as the post-quake vaudeville center of the city.",
        "address": "2961 16th St"
    },
    {
        "name": "SF Seals and Mission Reds",
        "history": "The San Francisco Seals and Mission Reds used to play at this 16th and Bryant location. Though the Giants played there briefly, it was torn down once Candlestick Park went up.",
        "address": "Bryant & 16th Streets"
    },
    {
        "name": "Mexican Museum",
        "history": "Founded in the Mission in 1975, the museum's Fort Mason location is hosting its 14,000 piece collection until the completion of a new downtown location.",
        "address": "649 Mission St #419"
    },
    {
        "name": "Redstone Building",
        "history": "Built in the 1910's by the San Francisco Labor Council, this building played a significant role in the 1934 General Strike. It has been host to many labor unions, over the years, (including Milk Wagon Drivers #226 and Candy Workers #158). It is now also home to the empanada shop, Chile Lindo.",
        "address": "2940 16th Street"
    },
    {
        "name": "SF Mime Troupe",
        "history": "These mimics are everything but silent. Founder R.G. Davis began their tradition of performing for free at Dolores Park over 50 years ago. An interesting historic sidenote: the current SF Mime Troupe home is the same location Fantasy Records formally occupied.",
        "address": "855 Treat St"
    },
    {
        "name": "Dianda's",
        "history": "This long-lived Italian bakery opened over 50 years ago, when the Mission was filled with Irish, Italian and German families. In 2003, the Dianda family sold the business to three longtime employees, who now run the shop.",
        "address": "2883 Mission St"
    },
    {
        "name": "Frida and Diego",
        "history": "The lobby of the SF General Hospital is home to Diego Rivera's la Tortillera and Frida Kahlo's portrait of local doctor Leo Eloesser, who was a friend to both artists.",
        "address": "1001 Potrero"
    },
    {
        "name": "Muralistas",
        "history": "Female painters were often restricted to coloring in the lines on the political, war-themed murals of their male counterparts before the muralistas took charge and began painting their own murals.",
        "address": "199 Osage St"
    },
    {
        "name": "Balmy Alley",
        "history": "Mia Gonzalez teamed up with local muralists to turn this once needle-strewn alleyway into a collection of murals in the 1970s. In the 1980s the murals became a visual protest against the Central American wars.",
        "address": "50 Balmy St"
    },
    {
        "name": "Galeria de la Raza",
        "history": "This nonprofit gallery was formed in the 1970's by several prominent artists in the Chicano Move-ment. The space has featured art, music, and poetry from all of Latin America and its immigrants in the Mission for the last 44 years.",
        "address": "2779 Folsom St, Ste. A"
    },
    {
        "name": "Francisco De Haro",
        "history": "Francisco De Haro, the first mayor of Yerba Buena (later known as San Francisco), is buried here, along with Luis Antonio Arguello (first and only governor during Mexican rule of Alta California) and 5,000 Ohlone and Miwok Indians who helped build the Mission Dolores.",
        "address": "54 Camp St"
    },
    {
        "name": "Clarion Alley",
        "history": "Since 1982, when Rigo 23 and Aaron Noble founded the Clarion Alley Mural Project, this alley has been a canvas for more experimental mural projects. While some are historical and political, like those in Balmy Alley, the ever-shifting collec-tion defies categorization.",
        "address": "Clarion Alley"
    },
    {
        "name": "Women's Building",
        "history": "In 1979, the San Francisco Women's Centers bought a former Sons of Norway Meeting Hall, and the Women's building was born. Both the building and its feminist mission have endured despite hecklers, doubters, and even an arsonist.",
        "address": "3543 18th St #8"
    },
    {
        "name": "Street Carts",
        "history": "In 2009, Brian Kimball started selling curries off a mobile cart. Both the curry and the concept thrived, drawing other vendors to the Mission Playground on Fridays.",
        "address": "16th & Mission"
    },
    {
        "name": "Temple Bnai David",
        "history": "The temple closed in 1978, and with it, one of San Francisco's few mikvahs for women's ritual baths. The building is now apartments filled with creative tenants.",
        "address": "3535 19th Street"
    },
    {
        "name": "ATA",
        "history": "This long-lived art space was created in the early 80's as a venue for video artists, back when few art galleries would give them the time of day.",
        "address": ""
    },
    {
        "name": "Low Riders",
        "history": "They may not cruise down Mission Street the way they did in the '70's, but they still make an appearance from time to time. When they do, they're a sight that is impossible to miss.",
        "address": "18th & Mission"
    },
    {
        "name": "Pipe Organ factory",
        "history": "Built in 1928, this building housed generations of organ-makers who learned their craft from company founder Felix Schoenstein, who built the organs for many Bay Area churches. Today it's home to the high-tech Other Machine Company.",
        "address": "3101 20th Street"
    },
    {
        "name": "El Tecolote",
        "history": "Professor Juan Gonzales of SF State started this bilingual newspaper in August 1970 as a way to channel more Latinos into journalism.",
        "address": "2958 24th St"
    },
    {
        "name": "Race Tracks",
        "history": "Horses used to race between what is now 20th and 24th streets.",
        "address": ""
    }
]
